{"keras_version": "1.2.0", "config": [{"config": {"name": "lambda_1", "function_type": "lambda", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001e<ipython-input-1-9e4d1727ad89>\u00da\b<lambda>\u0095\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape_type": "raw", "output_shape": null, "batch_input_shape": [null, 68, 160, 3]}, "class_name": "Lambda"}, {"config": {"bias": true, "name": "convolution2d_1", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "activation": "linear", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "nb_filter": 3, "b_regularizer": null, "nb_col": 1, "nb_row": 1}, "class_name": "Convolution2D"}, {"config": {"bias": true, "name": "convolution2d_2", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "nb_filter": 24, "b_regularizer": null, "nb_col": 5, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "convolution2d_3", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "nb_filter": 32, "b_regularizer": null, "nb_col": 5, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "convolution2d_4", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "nb_filter": 48, "b_regularizer": null, "nb_col": 5, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_3", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "convolution2d_5", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "nb_filter": 64, "b_regularizer": null, "nb_col": 3, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"bias": true, "name": "convolution2d_6", "dim_ordering": "tf", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "nb_filter": 64, "b_regularizer": null, "nb_col": 3, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "name": "dense_1", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "input_dim": 832, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_2", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "input_dim": 100, "output_dim": 50}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_3", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "input_dim": 50, "output_dim": 10}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_6", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_4", "b_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "input_dim": 10, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}